module.exports.regulars = {
    name: /^[A-Za-zА-Яа-яёЁ -]+$/,
    email: /^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/,
}

module.exports.errorMessages = {
    requiredField: "Обязательно для заполнения",
    incorrectName: "Имя может содержать только латиницу, кириллицу, пробел или дефис",
    incorrectEmail: "Некорректный email",
    incorrectPassword: "Пароль должен быть длиннее 8 символов",
  };